app/Views/layout/default.php

  use App\Models\UserModel;

  $userModel = new UserModel();
  $users = $userModel->find(session()->get('id_user'));
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '24'