app/Controllers/AdminPelatihan.php

SELECT *
FROM `pelatihan`
SELECT *
FROM `pelatihan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pelatihan`
---
    public function index()
    {
         //cara 1 dengan query builder
         $builder = $this->db->table('pelatihan');
         $query   = $builder->get();

         //cara 2
        //  $query = $this->db->query("SELECT * FROM pelatihan");

         $model = model(PelatihanModel::class);
        $data = [
            'pelatihan' => $model->paginate(5),
            'pager' => $model->pager,
        ];