app/Controllers/AdminRekap.php

SELECT COUNT(*) AS `numrows`
FROM `rekap`
SELECT *
FROM `rekap`
 LIMIT 10
---
    public function index()
    {
        $model = model(RekapModel::class);

        // Ambil keyword dari input pencarian
        $keyword = $this->request->getVar('keyword');

        // Cek apakah ada keyword yang diinputkan
        if ($keyword) {
            $model->like('nama_pelatihan', $keyword)
                  ->orLike('jadwal_pelatihan', $keyword)
                  ->orLike('lokasi_pelatihan', $keyword)
                  ->orLike('jumlah_peserta', $keyword);
        }

        // Hitung total hasil pencarian
        $totalResults = $model->countAllResults(false);

        $data = [
            'rekap' => $model->paginate(10),
            'pager' => $model->pager,
            'keyword' => $keyword, // Tambahkan keyword ke data untuk dikirim ke view
            'noResults' => ($totalResults == 0), // Cek jika tidak ada hasil
            'totalResults' => $totalResults // Kirim total hasil pencarian ke view
        ];