app/Controllers/AdminProduk.php

SELECT *
FROM `produk`
SELECT *
FROM `produk`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `produk`
---
    public function index()
    {
         //cara 1 dengan query builder
         $builder = $this->db->table('produk');
         $query   = $builder->get();

         //cara 2
         // $query = $this->db->query("SELECT * FROM produk");

        $model = model(ProdukModel::class);
        $data = [
            'produk' => $model->paginate(5),
            'pager' => $model->pager,
        ];