app/Controllers/AdminRekapLaporan.php

SELECT COUNT(*) AS `numrows`
FROM `rekap`
SELECT *
FROM `rekap`
 LIMIT 5
---
    public function index()
    {
        $model = model(RekapModel::class);

        // Ambil keyword dari input pencarian
        $keyword = $this->request->getVar('keyword');
        $bulan = $this->request->getVar('bulan');
        $tahun = $this->request->getVar('tahun');

        // Cek apakah ada keyword yang diinputkan
        if ($keyword) {
            $model->like('nama_pelatihan', $keyword)
                  ->orLike('jadwal_pelatihan', $keyword)
                  ->orLike('lokasi_pelatihan', $keyword)
                  ->orLike('jumlah_peserta', $keyword);
        }

        if ($bulan && $tahun) {
            $model->where('MONTH(jadwal_pelatihan)', $bulan);
            $model->where('YEAR(jadwal_pelatihan)', $tahun);
        }

        // Hitung total hasil pencarian
        $totalResults = $model->countAllResults(false);

        $data = [
            'rekap' => $model->paginate(5),
            'pager' => $model->pager,
            'keyword' => $keyword, // Tambahkan keyword ke data untuk dikirim ke view
            'bulan' => $bulan,
            'tahun' => $tahun,
            'noResults' => ($totalResults == 0),
            'totalResults' => $totalResults
        ];