app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `umkm`
SELECT COUNT(*) AS `numrows`
FROM `pelatihan`
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $umkmModel = new UmkmModel();
        $pelatihanModel = new PelatihanModel();
        $productsModel = new ProductModel();
        $usersModel = new UserModel();

        $data['totalUmkm'] = $umkmModel->countAllResults();
        $data['totalPelatihan'] = $pelatihanModel->countAllResults();
        $data['totalProducts'] = $productsModel->countAllResults();
        $data['totalUsers'] = $usersModel->countAllResults();