app/Controllers/AdminBerkas.php

SELECT *
FROM `berkas`
SELECT COUNT(*) AS `numrows`
FROM `berkas`
---
    public function index()
    {
        $berkas = new BerkasModel();
		$data['berkas'] = $berkas->findAll();

		$model = model(BerkasModel::class);

        $keyword = $this->request->getVar('keyword');

        // Cek apakah ada keyword yang diinputkan
        if ($keyword) {
            $model->like('berkas', $keyword)
                  ->orLike('keterangan', $keyword)
                  ->orLike('nama', $keyword);
        }

        $totalResults = $model->countAllResults(false);