app/Controllers/AdminUmkm.php

SELECT *
FROM `umkm`
---
    public function index()
    {
        //cara 1 dengan query builder
        $builder = $this->db->table('umkm');
        $query   = $builder->get();