app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'Ziqran'
---
    public function loginProcess()
    {
        $post =$this->request->getPost();
        $query = $this->db->table('users')->getWhere(['username' => $post['username']]);