app/Controllers/Berkas.php

SELECT *
FROM `berkas`
SELECT *
FROM `berkas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `berkas`
---
    public function index()
    {
        $berkas = new BerkasModel();
		$data['berkas'] = $berkas->findAll();

		$model = model(BerkasModel::class);
        $data = [
            'berkas' => $model->paginate(10),
            'pager' => $model->pager,
        ];