app/Controllers/Home.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $data['artikel'] = $this->model->findAll();