app/Controllers/Konten.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `foto_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `isi_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `tgl_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `author` LIKE '%selamat%' ESCAPE '!'
SELECT *
FROM `artikel`
WHERE `judul_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `foto_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `isi_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `tgl_artikel` LIKE '%selamat%' ESCAPE '!'
OR  `author` LIKE '%selamat%' ESCAPE '!'
 LIMIT 9
---
    public function informasi()
    {
        $model = new ArtikelModel();

        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $model->like('judul_artikel', $keyword)
                  ->orLike('foto_artikel', $keyword)
                  ->orLike('isi_artikel', $keyword)
                  ->orLike('tgl_artikel', $keyword)
                  ->orLike('author', $keyword);
        }

        $totalResults = $model->countAllResults(false);

        $data = [
            'artikel' => $model->paginate(9),
            'pager' => $model->pager,
            'keyword' => $keyword,
            'noResults' => ($totalResults == 0),
            'totalResults' => $totalResults
        ];