app/Controllers/Pelatihan.php

SELECT *
FROM `pelatihan`
---
    public function index()
    {
         //cara 1 dengan query builder
         $builder = $this->db->table('pelatihan');
         $query   = $builder->get();