app/Controllers/Penjualan.php

SELECT *
FROM `penjualan`
---
    public function index()
    {
         //cara 1 dengan query builder
         $builder = $this->db->table('penjualan');
         $query   = $builder->get();