app/Controllers/Perizinan.php

SELECT *
FROM `izin_usaha`
ORDER BY `id_izin` ASC
---
    public function index()
    {
        $PerizinanModel = new PerizinanModel();
        $data['izin_usaha'] = $PerizinanModel->orderBy('id_izin', 'ASC')->findAll();