app/Controllers/Product.php

    public function index()
    {
         //cara 1 dengan query builder
         $builder = $this->db->table('products');
         $query   = $builder->get();

         //cara 2
        //  $query = $this->db->query("SELECT * FROM products");
        $model = model(ProductModel::class);
        $data = [
            'products' => $model->paginate(5),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `products`
SELECT *
FROM `products`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `products`