app/Controllers/Register.php

INSERT INTO `users` (`nik`, `name_user`, `username`, `password`, `roles`, `created_at`, `updated_at`) VALUES ('1571010102960021', 'muhammada mada', 'mada123', '$2y$10$pXHLo/QycEbZIzImWM2QL.NxCPnD1zhKJxfhLEDWTo/5Ym8ZH23RG', 'UMKM', '2024-06-17 13:32:51', '2024-06-17 13:32:51')
---
    public function save()
    {
        //include helper form
        helper(['form']);
        //setting rules buat validasi form
        $rules = [
            'nik' => 'required|numeric',
            'name_user' => 'required|min_length[3]|max_length[20]',
            'username' => 'required|min_length[6]|max_length[50]',
            'password' => 'required|min_length[6]|max_length[200]',
            'password_confirmation' => 'required|min_length[6]|max_length[200]|matches[password]',
            'bidang_usaha' => 'required|min_length[6]|max_length[50]',
            'omzet_biaya' => 'required|min_length[6]|max_length[100]',
            'no_hp' => 'required|numeric',
        ];

        if ($this->validate($rules)) {
            //insert data user
            $modeluser = new UserModel();
            $datauser = [
                'nik' => $this->request->getVar('nik'),
                'name_user' => $this->request->getVar('name_user'),
                'username' => $this->request->getVar('username'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
                'roles' => "UMKM"
            ];
            $modeluser->save($datauser);

INSERT INTO `umkm` (`nik`, `nama`, `nama_usaha`, `alamat`, `kelurahan`, `kecamatan`, `alamat_usaha`, `bidang_usaha`, `nib`, `npwp`, `omzet_biaya`, `jumlah_tenaga_kerja`, `no_hp`, `created_at`, `updated_at`) VALUES ('1571010102960021', 'adam', 'Ternak Tuyul', 'jl neraka firdaus', 'monyet', 'sapi', 'jl bangsat', 'Dagang', '123', '456', NULL, '7', '081229818843', '2024-06-17 13:32:51', '2024-06-17 13:32:51')
---
                'jumlah_tenaga_kerja' => $this->request->getVar('jumlah_tenaga_kerja'),
                'no_hp' => $this->request->getVar('no_hp'),
            ];
            $modelumkm->save($dataumkm);