app/Controllers/Umkm.php

SELECT *
FROM `umkm`
WHERE `umkm`.`id_umkm` = '63'
---
    public function edit($id = null)
    {
        if($id != null){
            $query = $this->db->table('umkm')->getWhere(['id_umkm' => $id]);