app/Controllers/UserProfile.php

    public function index()
    {
        $userModel = new UserModel();
        $userId = session()->get('id_user');
        $users = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '24'